---
kind: type
id: T:Autodesk.Revit.DB.DetailCurve
source: html/21cd770e-fb1b-9fd9-b3a0-cdd6ba87df2b.htm
---
# Autodesk.Revit.DB.DetailCurve

A curve that is used to create a detail drawing.
A detail curve is visible only in the view in which it is drawn.

## Syntax (C#)
```csharp
public class DetailCurve : CurveElement
```